[
  {
    "index": 0,
    "type": "module",
    "title": "Getting to Know You",
    "desc": "Introduce yourself and your vision. Let's tailor your journey!",
    "image": "person.crop.circle",
    "collectable": "none",
    "pathPosition": "start",
    "content": [
      {
        "title": "Welcome to Your Founder Journey",
        "content": "Welcome to LaunchLab! Before we begin, we'd like to know more about you and your business idea. This will help us tailor the experience to your needs. Don’t worry if you don’t have all the answers yet!",
        "image": "sparkles",
        "type": "info"
      },
      {
        "title": "Your Motivation",
        "content": "What inspired you to consider starting a business? Share your motivation!",
        "image": "lightbulb.circle.fill",
        "type": "multiple_choice"
        "options": ["To be my own Boss", "Bringing innovative ideas to the world", "Solving a problem that is important to me", "Achieving financial success"]
      },
      {
        "title": "Your Business Idea",
        "content": "Do you already have a business idea? If yes, briefly describe it. If not, write about what excites you about becoming a founder.",
        "image": "brain.head.profile",
        "type": "textfield"
      },
      {
        "title": "Your Target Group",
        "content": "Who is your startup for? Who is your target group?",
        "image": "lightbulb.circle.fill",
        "type": "multiple_choice"
        "options": [" Pupils and students", "Professionals or companies", "Tech enthusiasts", "I don’t know yet"]
      },
      {
        "title": "Your Stage",
        "content": "Where are you currently with your startup?",
        "image": "flag.checkered",
        "type": "multiple_choice",
        "options": ["I don't have an idea yet.", "I have an idea and want to implement it", "I am already working on my startup", "I already have a running startup"]
      },
      {
        "title": "Your Goals",
        "content": "What are your primary goals for using this app? (Select all that apply.)\n\n- Developing a business idea.\n- Understanding customers and the market.\n- Building a network and finding partners.\n- Learning about legal and financial aspects.\n- Other (please specify).",
        "image": "target",
        "type": "multiple_choice",
        "options": [
          "Developing a business idea",
          "Understanding customers and the market",
          "Building a network and finding partners",
          "Learning about legal and financial aspects",
          "Other"
        ]
      },
      {
        "title": "Your Background",
        "content": "Tell us a little about your background. What is your professional experience or expertise? This will help us provide tailored tips and examples.",
        "image": "person.crop.rectangle.stack",
        "type": "textfield"
      },
      {
        "title": "Your Time Commitment",
        "content": "How much time per week can you dedicate to your startup journey? This will help us suggest a realistic pace for you.",
        "image": "clock.fill",
        "type": "multiple_choice",
        "options": ["Less than 5 hours", "5–10 hours", "10–20 hours", "More than 20 hours"]
      },
      {
        "title": "Congratulations on Starting!",
        "content": "Thank you for sharing your story and goals. Let’s get started with your first module and begin turning your vision into reality!",
        "image": "hand.thumbsup.circle.fill",
        "type": "info"
      }
    ]
  },
  {
    "index": 1,
    "type": "module",
    "title": "Idea Development",
    "desc": "Learn to transform raw ideas into actionable business concepts.",
    "image": "ideas",
    "collectable": "collectable1",
    "pathPosition": "right",
    "content": [
      {
        "title": "Brainstorming Techniques",
        "content": "Explore methods to generate and refine innovative ideas.\nThe best ideas emerge when you think freely and creatively. Use brainstorming techniques such as:\n\n- **Mind Mapping**: Write your central theme in the middle and expand it with associations.\n- **Thinking Hats**: View your problem from different perspectives (e.g., positive, critical, emotional).\n- **Reverse Thinking**: Consider how you would worsen the problem, then find solutions to achieve the opposite. ",
        "image": "lightbulb.circle.fill",
        "type": "info"
      },
      {
        "title": "Brainstorming Practice",
        "content": "Create a mind map for a problem you observe. Write down at least five possible ideas to solve it.",
        "image": "lightbulb.circle",
        "type": "textfield"
      },
      {
        "title": "Problem Solving",
        "content": "Identify real-world problems and develop solutions that add value. A problem is the starting point for every great business idea. Use the 5-Why method to find the root cause:\n\n1. Why does the problem occur?\n2. Why is it relevant?\n3. Find the core cause and consider: How could your solution look?",
        "image": "wand.and.rays",
        "type": "info"
      },
      {
        "title": "Problem Solving Practice",
        "content": "Formulate the problem you want to solve in one sentence. Describe your solution idea in two sentences.",
        "image": "questionmark.circle",
        "type": "textfield"
      },
      {
        "title": "Vision and Goals",
        "content": "Define a clear vision and achievable goals for your startup. Your vision gives your startup direction, and your goals make it actionable. Consider:\n\n- **Vision**: What do you want to achieve with your startup?\n- **Goals**: What concrete steps will lead you there?",
        "image": "target",
        "type": "info"
      },
      {
        "title": "Vision and Goals Practice",
        "content": "Formulate your startup's vision in one sentence. Write down three specific goals you aim to achieve within the next six months.",
        "image": "target",
        "type": "textfield"
      }
    ]
  },
  {
    "index": 2,
    "type": "module",
    "title": "Product Development",
    "desc": "Build and refine your product to meet customer needs. Create an initial prototype.",
    "image": "product",
    "collectable": "collectable1",
    "pathPosition": "left",
    "content": [
      {
        "title": "Understand Prototyping",
        "content": "Create your product by developing first prototypes, preliminary versions of your product that demonstrate its core features and furthermore enable to test its functionality, design, or usability with test users. Commonly, the aim is to build a Mininal Viable Products (MVP) in order to convince investors and thus secure fundings. Learn how to:\n\n- Identify essential features.\n- Build a Minimum Viable Product.\n- Gather early feedback to improve your design.",
        "image": "cube.fill",
        "type": "info"
      },
      {
        "title": "Product or Service",
        "content": "Do you want to offer a physical or software-based product, or a service? Describe your product or service accurately.",
        "image": "cube",
        "type": "textfield"
      },
      {
        "title": "Key functionalities",
        "content": "List the key features of your product and describe them. Outline what your first prototype will include.",
        "image": "cube",
        "type": "textfield"
      },
      {
        "title": "Types of prototypes I",
        "content": "There are various types of prototypes, each suited for different stages of product development:\n\n- **Evolutionary Prototyping:** Build a prototype that evolves over time with user feedback, gradually becoming the final product. Useful tools: Figma or Axure RP.\n\n- **Throwaway (Rapid) Prototyping:** Quickly create a prototype to gather early feedback, then discard it. Ideal for exploring ideas. Use tools like paper sketches, Adobe XD, or Marvel App.\n\n- **Low-Fidelity Prototyping:** Focus on the basic structure and functionality of the product without detailed visuals. Great for early-stage brainstorming. Tools: Balsamiq, Lucidchart, or whiteboards.\n\n- **High-Fidelity Prototyping:** Create detailed, interactive prototypes that closely resemble the final product. Ideal for testing design and functionality. Tools: Figma, InVision, or React.,,
        "image": "cube.fill",
        "type": "info"
      },
      {
        "title": "Prototype Version",
        "content": "Are you planning an evolutionary or throwaway prototype, or maybe a mix along the way? Describe briefly.",
        "image": "cube",
        "type": "textfield"
      },
      {
        "title": "Prototype-Fidality",
        "content": "Are you planning a simple (low-fidelity) or detailed (high-fidelity) prototype? What form would be useful?",
        "image": "cube",
        "type": "textfield"
      },
      {
        "title": "Resources",
        "content": "What resources (time, budget, tools) do you have available to develop a prototype?",
        "image": "cube",
        "type": "textfield"
      },
      {
        "title": "Iterative Design",
        "content": "Product development is an iterative process. Test your prototype, gather feedback, and refine. Use the **Build-Measure-Learn** loop:\n\n1. Build: Develop your MVP.\n2. Measure: Test it with real users such as friends, family members etc. .\n3. Learn: Improve based on feedback.",
        "image": "arrow.triangle.2.circlepath",
        "type": "info"
      },
      {
        "title": "Prototype Testing",
        "content": "Who will test your prototype and how are you planning to reach out to these people? List your test groups in descending importancy.",
        "image": "cube",
        "type": "textfield"
      },
      {
        "title": "Iterative Design Practice",
        "content": "List three ways you can test your prototype and gather meaningful feedback.",
        "image": "doc.text.magnifyingglass",
        "type": "textfield"
      },
      {
        "title": "Prototype Testing II",
        "content": "How will you ensure that your prototype enables accurate and reliable user feedback? e.g. time-tracking, location-setup etc.",
        "image": "cube",
        "type": "textfield"
      }
    ]
  }
,
  {
    "index": 3,
    "type": "document",
    "title": "Elevator Pitch",
    "desc": "Create an Elevator Pitch.",
    "image": "businessplan",
    "pathPosition": "center",
    "content": []
  },
  {
    "index": 4,
    "type": "module",
    "title": "Customer Analysis",
    "desc": "Understand your customer.",
    "image": "customer",
    "collectable": "collectable2",
    "pathPosition": "right",
    "content": [
      {
        "title": "Customer Personas",
        "content": "Understand your costumer needs to ensure that every decision you make aligns with their needs, increasing your chances of success in a competitive market. By identifying what your customers want and need, you can develop solutions that truly solve their problems, increase customer satisfaction and loyalty, and stay competitive in your market by addressing unmet demands. \n\n### Here is how you can detect Customer Needs:\n- **Surveys and Questionnaires:** Collect direct feedback on preferences and pain points.\n- **Interviews:** Conduct in-depth conversations with potential users to gain qualitative insights.\n- **Focus Groups:** Gather a group of individuals representing your target audience to discuss their needs and expectations.\n- **Market Research:** Analyze industry trends and competitor offerings.\n- **User Behavior Analysis:** Study analytics from websites or apps to identify user patterns and preferences.\n\n### Sources for Creating Customer Personas:\n- **Social Media Insights:** Platforms like Facebook and Instagram provide demographic and interest data.\n- **Customer Feedback:** Use reviews, support tickets, and testimonials to identify recurring themes.\n- **Competitor Analysis:** Examine how competitors engage with their audience and what solutions they offer.\n- **Industry Reports:** Leverage professional market research reports for broader trends and data.\n\nCombining these methods ensures your customer personas are accurate, actionable, and grounded in real user behavior, giving you a solid foundation for decision-making and product development. Finally, create a Customer Persona, a fictional representation of your ideal customer by defining your target audience by:\n\n- Demographics: Age, location, income.\n- Psychographics: Interests, values, lifestyle.\n- Pain Points: What problems do they face?",
        "image": "person.crop.circle",
        "type": "info"
      },
      {
        "title": "Costumer Problems",
        "content": "In one sentence, what problems or needs does the target audience have?",
        "image": "person.circle",
        "type": "textfield"
      },
      {
        "title": "Customer Persona Upload",
        "content": "Have you already created personas or another form of user perspective? If so, please upload your file here.",
        "image": "person.circle",
        "type": "textfield"
      },
      {
        "title": "Customer Persona Creation",
        "content": "Describe your ideal customer as detailed as possible and well-structured. Include their demographics, psychographics, and main challenges.",
        "image": "person.circle",
        "type": "textfield"
      },
      {
        "title": "Customer Journey Mapping",
        "content": "Understand your customer's product experience by mapping their journey. Identify:\n\n1. How they discover your product.\n2. What steps they take to purchase or use it.\n3. Pain points along the way.",
        "image": "map",
        "type": "info"
      },
      {
        "title": "Costumer Journey Mapping Upload",
        "content": "Have you already created a customer journey map? If so, please upload your file here.",
        "image": "person.circle",
        "type": "textfield"
      },
      {
        "title": "Customer Journey Creation",
        "content": "Create a short customer journey for your product. Highlight one potential obstacle and how you’ll address it.",
        "image": "map.fill",
        "type": "textfield"
      }
    ]
  }
,
  {
    "index": 5,
    "type": "consultation",
    "title": "Consultation",
    "desc": "",
    "image": "chatbubbles",
    "pathPosition": "center",
    "content": []
  },
  {
    "index": 6,
    "type": "module",
    "title": "Competitive Analysis",
    "desc": "Identify your competitors and define your unique advantage.",
    "image": "competitors",
    "collectable": "collectable3",
    "pathPosition": "left",
    "content": [
      {
        "title": "Identifying Competitors",
        "content": "Competitive analysis is the process of identifying and evaluating your competitors. It helps you uncover gaps in the market, refine your value proposition, and develop strategies to differentiate your business. By analyzing the competition, you gain insights into industry trends, customer expectations, and potential opportunities enabling you to make informed decisions and position your company for success. Competitive analysis is a foundational step for anyone entering the market. Competitors can be direct (same product) or indirect (solving the same problem differently). Analyze their:\n\n- Products or services.\n- Strengths and weaknesses.\n- Pricing and market positioning.",
        "image": "chart.bar",
        "type": "info"
      },
      {
        "title": "Competitors",
        "content": "List at least three direct or indirect competitors!",
        "image": "chart.pie",
        "type": "textfield"
      },
      {
        "title": "Competitor products",
        "content": "How do your competitors solve your target group’s problems? Please sort the already existing products, services or makeshift solutions.",
        "image": "chart.pie",
        "type": "textfield"
      },
      {
        "title": "Pros and Cons",
        "content": "What are they doing well, and what are the challenges or weaknesses of their existing solutions?",
        "image": "chart.pie",
        "type": "textfield"
      },
      {
        "title": "Unique Selling Proposition (USP)",
        "content": "Your USP is what sets you apart. It answers the question: Why should customers choose you over others?",
        "image": "star.fill",
        "type": "info"
      },
      {
        "title": "USP Practice",
        "content": "Write one sentence describing your USP. What makes your product unique or special compared to existing solutions? Why should customers choose your offering? (e.g., price, quality, innovation etc.)",
        "image": "star.circle",
        "type": "textfield"
      },
      {
        "title": "Solution Combination",
        "content": "Could you combine your idea with existing approaches or technologies to improve it? If so, describe how.",
        "image": "star.circle",
        "type": "textfield"
      }
    ]
  }
,
{
  "index": 7,
  "type": "module",
  "title": "Networking",
  "desc": "Build meaningful connections with experts and partners to bring your business idea to life.",
  "image": "networking",
  "collectable": "collectable3",
  "pathPosition": "right",
  "content": [
    {
      "title": "The Importance of Strategic Networking",
      "content": "Networking is more than meeting people—it’s about building relationships that help your business grow. External experts, mentors, and strategic partners can provide:\n\n- **Expertise**: Legal, marketing, or technical advice.\n- **Resources**: Access to tools, suppliers, or funding.\n- **Opportunities**: Collaborations or introductions to key contacts.",
      "image": "person.3.fill",
      "type": "info"
    },
    {
      "title": "Networking Practice",
      "content": "List three types of experts or partners you need to support your business idea. What role will each play?",
      "image": "person.crop.circle.badge.plus",
      "type": "textfield"
    },
    {
      "title": "Building Your Support Network",
      "content": "A strong network can guide you through challenges and open doors. To build your network:\n\n- **Attend Events**: Join industry meetups, conferences, and startup hubs.\n- **Seek Mentors**: Look for experienced entrepreneurs who can guide you.\n- **Engage Online**: Use platforms like LinkedIn to connect with professionals.",
      "image": "network",
      "type": "info"
    },
    {
      "title": "Support Network Practice",
      "content": "Identify one event or platform where you can meet potential mentors or partners. What is your goal for this interaction?",
      "image": "figure.stand.line.dotted.figure.stand",
      "type": "textfield"
    },
    {
      "title": "Leveraging Strategic Partnerships",
      "content": "Strategic partnerships can give you a competitive edge. Partners can:\n\n- **Provide Resources**: Share tools, services, or knowledge.\n- **Expand Reach**: Help you access new customers or markets.\n- **Collaborate on Projects**: Combine expertise to develop products or campaigns.",
      "image": "hand.raised.fill",
      "type": "info"
    },
    {
      "title": "Partnership Practice",
      "content": "Think of one potential strategic partner. What value would this partnership bring to your business, and how could you approach them?",
      "image": "hand.raised",
      "type": "textfield"
    }
  ]
}
,
  {
    "index": 8,
    "type": "document",
    "title": "Pitch Deck",
    "desc": "Create a Pitch Deck.",
    "image": "businessplan",
    "pathPosition": "center",
    "content": []
  },
  {
    "index": 9,
    "type": "module",
    "title": "Marketing & Customer Relationships",
    "desc": "Learn to build a brand and engage with your audience.",
    "image": "marketing",
    "collectable": "collectable2",
    "pathPosition": "left",
    "content": [
      {
        "title": "Building Your Brand",
        "content": "A strong marketing strategy is essential for anyone entering the founding market because it bridges the gap between your product and your customers. It ensures that your message reaches the right people, through the right channels, at the right time. Without a clear plan, you risk wasting resources on efforts that don't connect with your target audience or drive results. A well-crafted strategy helps you prioritize the channels your customers use most, engage them effectively, and build trust. It also allows you to measure success and adjust your approach as needed.",
        "image": "paintbrush.fill",
        "type": "info"
      },
      {
        "title": "Brand Practice",
        "content": "Write a tagline for your brand that captures its essence in one sentence.",
        "image": "paintbrush",
        "type": "textfield"
      },
      {
        "title": "Engaging Your Audience",
        "content": "Effective customer relationships are built on trust and communication. Use:\n\n- Social Media: Connect where your audience spends time.\n- Email Campaigns or Communities: Keep them informed and engaged.\n- Personalization: Make your communication relevant. - Offline marketing: Visit entrepreneur fairs, distribute flyers at optimal locations etc.",
        "image": "envelope.fill",
        "type": "info"
      },
      {
        "title": "Audience Engagement",
        "content": "List at least three ways you will interact with your audience. Be specific about the channels and message types. Will the interactions be personal or automated?",
        "image": "envelope.open",
        "type": "textfield"
      },
      {
        "title": "Audience Engagement Priority",
        "content": "Which channels will you prioritize, and why? You can focus on which channels are used most frequently by your target group. ",
        "image": "envelope.open",
        "type": "textfield"
      },
      {
        "title": "?",
        "content": "What steps will you take to acquire and retain customers long-term? ",
        "image": "envelope.open",
        "type": "textfield"
      },
      
    ]
  }
,
{
  "index": 10,
  "type": "module",
  "title": "Financing and Resources",
  "desc": "Secure funding and manage resources effectively.",
  "image": "financing",
  "collectable": "collectable3",
  "pathPosition": "right",
  "content": [
    {
      "title": "Funding Options",
      "content": "Financing and resources are the lifeblood of any startup. Without a clear plan for funding and resource management, even the best ideas can fail to materialize. Securing the right financial backing ensures you can build, sustain, and grow your business, while efficient resource allocation helps you maximize output and minimize waste. Proper financial planning also allows you to weather unexpected challenges and invest in critical areas like marketing, product development, and talent. There are various ways to fund your startup:\n\n- **Bootstrapping**: Use personal savings.\n- **Investors**: Seek venture capital or angel investors.\n- **Crowdfunding**: Raise funds from the public.",
      "image": "banknote.fill",
      "type": "info"
    },
    {
      "title": "Funding Practice",
      "content": "Choose one funding option and explain why it suits your startup.",
      "image": "banknote",
      "type": "textfield"
    },
    {
      "title": "Managing Resources",
      "content": "Efficiently allocate your time, money, and people and keep track of all of these components by using tools like:\n\n- Budgeting software.\n- Project management tools.\n- Regular performance reviews.",
      "image": "calendar",
      "type": "info"
    },
    {
      "title": "Resource Management Practice",
      "content": "List three priorities for your resource allocation in the next quarter.",
      "image": "calendar.badge.clock",
      "type": "textfield"
    }
  ]
}
,
  {
    "index": 11,
    "type": "consultation",
    "title": "Consultation",
    "desc": "",
    "image": "chatbubbles",
    "progress": 0,
    "pathPosition": "center",
    "content": []
  },
  {
    "index": 12,
    "type": "module",
    "title": "Timeline and Milestones",
    "desc": "Plan and track your startup's progress.",
    "image": "timeline",
    "collectable": "collectable1",
    "pathPosition": "left",
    "content": [
      {
        "title": "Setting Milestones",
        "content": "Milestones are key achievements that mark your progress. Examples include:\n\n- Launching your product.\n- Reaching your first 100 customers.\n- Securing funding.",
        "image": "flag.fill",
        "type": "info"
      },
      {
        "title": "Milestone Practice",
        "content": "Set three milestones for your startup for the next 12 months. Be specific and include deadlines.",
        "image": "flag",
        "type": "textfield"
      },
      {
        "title": "Creating a Timeline",
        "content": "A timeline helps you visualize progress. Include:\n\n- Key activities.\n- Deadlines for each milestone.\n- Dependencies between tasks.",
        "image": "clock.arrow.circlepath",
        "type": "info"
      },
      {
        "title": "Timeline Practice",
        "content": "Outline a timeline for the next six months. Include at least three key activities.",
        "image": "clock",
        "type": "textfield"
      }
    ]
  }
,
{
  "index": 13,
  "type": "module",
  "title": "Team Building",
  "desc": "Assemble and manage a strong team.",
  "image": "team",
  "collectable": "collectable3",
  "pathPosition": "right",
  "content": [
    {
      "title": "Roles and Responsibilities",
      "content": "While Networking is building an external network of experts, partners, and supporters who can indirectly strengthen your business, Team Building focuses on your internal team that directly works on executing your business idea. Define roles to ensure everyone knows their responsibilities. Common startup roles include:\n\n- CEO: Vision and strategy.\n- CTO: Technology and product.\n- CMO: Marketing and sales.",
      "image": "person.2.fill",
      "type": "info"
    },
    {
      "title": "Roles Practice",
      "content": "List the key roles in your team. For each, write one main responsibility.",
      "image": "person.2",
      "type": "textfield"
    },
    {
      "title": "Team Culture",
      "content": "Build a positive team culture with:\n\n- Clear communication.\n- Mutual respect.\n- Shared values and goals.",
      "image": "heart.fill",
      "type": "info"
    },
    {
      "title": "Team Culture Practice",
      "content": "Write down three values/principles that define your team culture.",
      "image": "heart",
      "type": "textfield"
    }
  ]
}
,
  {
    "index": 14,
    "type": "document",
    "title": "Business Plan",
    "desc": "Create a Business Plan.",
    "image": "businessplan",
    "pathPosition": "center",
    "content": []
  },
  {
    "index": 15,
    "type": "module",
    "title": "Legal Rights and Company Formation",
    "desc": "Build a legally sound foundation for your business.",
    "image": "gavel",
    "collectable": "collectable3",
    "pathPosition": "left",
    "content": [
      {
        "title": "Why Legal Rights Matter",
        "content": "Understanding your legal rights and obligations is vital when starting a business. It ensures you:\n\n- Operate within the law.\n- Protect your intellectual property.\n- Avoid costly disputes.\n\nKnowing the legal framework builds trust with stakeholders and empowers you to make informed decisions, allowing you to focus on growing your business confidently.",
        "image": "scales.3d",
        "type": "info"
      },
      {
        "title": "Legal Forms in Germany",
        "content": "Choosing the correct legal form for your business in Germany is critical, as it determines taxes, liability, and operational flexibility. Here are the most common options:\n\n1. **Einzelunternehmen (Sole Proprietorship):** Simple and cost-effective; suited for small businesses but with unlimited personal liability.\n2. **GbR (Gesellschaft bürgerlichen Rechts):** Ideal for two or more partners, easy to establish, but partners have unlimited liability.\n3. **UG (Unternehmergesellschaft):** A 'mini GmbH,' requiring only €1 in share capital, offering limited liability.\n4. **GmbH (Gesellschaft mit beschränkter Haftung):** Popular for SMEs, requires €25,000 share capital and offers limited liability.\n5. **AG (Aktiengesellschaft):** Suitable for large companies; requires €50,000 in share capital and allows for publicly traded shares.\n6. **Freiberufler (Freelancer):** For professionals like architects, consultants, or artists; less bureaucratic but limited to specific professions.\n\nEach form has unique requirements. Research thoroughly to select the one that aligns with your business goals.",
        "image": "globe.europe.africa",
        "type": "info"
      },
      {
        "title": "Legal Structure Practice",
        "content": "What legal form do you think suits your business in Germany? Explain your choice in a few sentences.",
        "image": "building.columns.fill",
        "type": "textfield"
      },
      {
        "title": "Intellectual Property (IP) Protection",
        "content": "Your ideas are your assets. Protecting intellectual property ensures that others cannot misuse or replicate your innovations. Key types of IP include:\n\n- Trademarks: Protect your brand.\n- Patents: Safeguard your inventions.\n- Copyrights: Secure rights over creative works.\n\nEnsure you understand which protections apply to your business.",
        "image": "key.fill",
        "type": "info"
      },
      {
        "title": "Intellectual Property Practice",
        "content": "Does your business rely on a unique brand, product, or idea? Identify which type of intellectual property protection you might need and why.",
        "image": "lightbulb.fill",
        "type": "textfield"
      },
      {
        "title": "Legal Compliance Checklist",
        "content": "Compliance ensures your business operates lawfully. Areas to focus on include:\n\n- Business Registration: Are you officially registered?\n- Tax Obligations: Do you know your tax requirements?\n- Employment Laws: Are you aware of employee rights and contracts?\n\nStaying compliant avoids fines, lawsuits, and reputational damage.",
        "image": "checkmark.square.fill",
        "type": "info"
      },
      {
        "title": "Compliance Practice",
        "content": "List three legal or regulatory requirements your business must meet. How will you ensure compliance in each area?",
        "image": "doc.plaintext.fill",
        "type": "textfield"
      },
      {
        "title": "Contracts and Agreements",
        "content": "Contracts form the backbone of trust and accountability in business relationships. Common agreements include:\n\n- Employment contracts.\n- Supplier agreements.\n- Partnership agreements.\n\nDraft clear contracts to define roles, responsibilities, and expectations while minimizing misunderstandings.",
        "image": "doc.text",
        "type": "info"
      },
      {
        "title": "Contract Drafting Practice",
        "content": "Think about an essential business relationship (e.g., with a supplier or partner). What key terms would you include in a contract with them?",
        "image": "doc.richtext.fill",
        "type": "textfield"
      },
      {
        "title": "Seeking Legal Support",
        "content": "Navigating legal complexities can be overwhelming. Consider seeking help from:\n\n- Business lawyers.\n- Legal consultants.\n- Mentorship programs specializing in legal advice.\n\nExternal expertise helps you focus on your strengths while staying protected.",
        "image": "person.2.wave.2.fill",
        "type": "info"
      },
      {
        "title": "Legal Support Practice",
        "content": "Do you plan to work with legal experts or mentors? If yes, identify the type of support you need and how you’ll find it.",
        "image": "person.badge.plus.fill",
        "type": "textfield"
      },
      {
        "title": "Summary and Reflection",
        "content": "Congratulations! You’ve gained an understanding of legal rights and their importance in building a strong foundation for your business. Stay proactive in addressing legal matters, and don’t hesitate to seek professional advice to stay protected.",
        "image": "checkmark.seal.fill",
        "type": "info"
      }
    ]
  }

]

